Repository: OpenChain-Project/Curriculum-Translation-JP
Catalog: Curriculum-Translation-JP-omegat.tmx
Source language: en_us
Languages: ja

source: Proprietary licenses are unique to each vendor - there are as many variations of proprietary licenses as there are vendors and each must be evaluated individually
ja: プロプライエタリ ライセンスはベンダー毎に独自性があります－ベンダーがあるだけプロプライエタリ ライセンスもたくさんのバリエーションがあり、それぞれ個別評価されなければなりません。

source: Proprietary licenses often involve payment or a license fee
ja: プロプライエタリ ライセンスには、多くの場合、支払やライセンス料といったものを伴います。

source: Protects expression (not the underlying idea)
ja: （内面のアイデアではなく）表現を保護する

source: Provide a copy of the license
ja: ライセンスの写しを提供すること

source: Provide access to source code (whether you modified it or not)
ja: （改変の有無を問わず）ソースコードへのアクセス先を提供すること

source: Provide accompanying source code along with any associated build tools and documentation (e.g., by uploading to a distribution website or including in the distribution package)
ja: 添付ソースコードを関連ビルドツールや文書類とともに提供する（例：頒布Webサイトへアップロードする、頒布パッケージに含める）

source: Provide accompanying source code as required
ja: 添付ソースコードを要求される形で提供する

source: Provide attribution
ja: 帰属表示を提供すること

source: Provide feedback to the appropriate engineers to resolve issues in the audit report that conflict with your FOSS policy
ja: 監査レポートにあるFOSSポリシーと合わない問題を解決するために適切なエンジニアに向けたフィードバックを提供する

source: Provide guidance in light of company policy and business objectives
ja: 企業のポリシーや事業方針の観点からの助言の提供

source: Provide notice of modifications
ja: 改変告知を提供すること

source: Providing accompanying source code
ja: ソースコードの添付による提供

source: Public Domain
ja: パブリック ドメイン

source: Publish source code,
ja: ソースコード、告知／通知／表示（notice）、書面による申し出（written offer）

source: Recognize and review any FOSS components added to a repository without an incoming request
ja: リポジトリに追加された入力リクエストのないすべてのFOSSコンポーネントを識別し、レビューを実施する

source: Record approved
ja: 承認された

source: Registration
ja: 登録（Registration）

source: Registration / Approval Tracking
ja: 登録／承認の追跡

source: Registration/approval tracking
ja: 登録／承認の追跡

source: Registration/approval tracking – Track approval conditions and license obligations for later compliance steps.
ja: 登録／承認の追跡－その後のステップのために承認の条件とライセンス義務を追跡します。

source: Released under the Creative Commons CC0 1.0 Universal license.
ja: 本資料は Creative Commons CC0 1.0 Universal ライセンスの下でリリースされています。

source: Relevant terms include:
ja: 関連する用語として以下のものがあります：

source: Remember, different licenses have different obligations.
ja: ライセンスが違えばその義務も変わってくることを覚えておいてください。

source: Reproduce the entire text of the license agreements for the FOSS code included in the product as needed
ja: 必要に応じ製品に含まれるFOSSコードのライセンス同意書全文をコピーします。

source: Resolve Issues
ja: 問題の解決（Resolve Issue）

source: Resolve all issues identified in the audit
ja: 監査で確認された全ての問題を解決する

source: Resolve any
ja: 企業のFOSSポリシーに添って

source: Resolving Issues
ja: 問題を解決する（Resolving Issues）

source: Resolving issues
ja: 問題の解決（Resolving issues）

source: Resolving issues - Remove FOSS usage that is incompatible with FOSS policies.
ja: 問題を解決する－ FOSSポリシーに合致しないFOSSの使用を除去します。

source: Respect FOSS developer rights and comply with license obligations
ja: FOSS開発者の権利を尊重し、ライセンス義務を果たす

source: Retain copyright (and other) notices
ja: 著作権表示（およびその他の告知／通知／表示）を保持すること

source: Review and approve
ja: FOSS ソフトウェア コンポーネントの

source: Review the audit report and confirm any discovered issues are resolved
ja: 監査レポートをレビューし、発見されたすべての問題を解決する

source: Reviews
ja: レビュー（Review）

source: Running a FOSS Review
ja: FOSSレビューを実施する

source: Satisfy all the license obligations for the FOSS that is used.
ja: 使用されるFOSSに対し全てのライセンスの義務を果たすこと。

source: Scan or audit source code
ja: ソースコードのスキャン、監査

source: Scanning
ja: スキャン

source: Scanning and tooling support team to help identify and track FOSS usage
ja: FOSSの使用を確認し、追跡することを支援するスキャン＆ツールチーム

source: Scanning and tooling teams that identify and track FOSS usage.
ja: FOSSの使用を特定し、追跡するスキャン＆ツールチーム

source: Scans of entire platform may be performed
ja: 全プラットフォームのスキャンが実施される

source: Shared headers
ja: 共通ヘッダ

source: Shareware - proprietary software provided to users on a trial basis, for a limited time, free of charge and with limited functionalities or features
ja: シェアウェア－無料で期間・機能限定した試用を基本として使用者に提供されるプロプライエタリのソフトウェア

source: Small companies may just use a checklist while larger enterprises will have a detailed process.
ja: 大企業が詳細なプロセスを保有する一方で小規模の企業ではチェックリストを使うだけの場合があります。

source: Smaller companies may wish to approach the process in a more streamlined way.
ja: 小規模な企業では、より簡素化したプロセスで取組むことが望まれます。

source: Socket interface
ja: ソケット インターフェース

source: Software can be subject to a patent.
ja: ソフトウェアは特許を受けることができます。

source: Software is protected by copyright, not the functionality (that’s protected by patents) but the expression (creativity in implementation details)
ja: ソフトウェアは、著作権によって保護される。（特許権で保護される）機能ではなく表現（実装の細部における独創性）

source: Software, books, audiovisual materials, semiconductor masks
ja: ソフトウェア、書物、音響・映像作品、半導体マスク（回路パターンの原版）

source: Some FOSS licenses are compatible with each other.
ja: FOSSにはお互いに両立できるものがあります。

source: Some are incompatible.
ja: 両立ができないものもあります。

source: Some licenses define the trigger event to include permitting access to software running on a server (e.g., all versions of the Affero GPL if the software is modified)
ja: いくつかのライセンスがサーバ上で実行されているソフトウェアへのアクセスを可能にすることを含めたトリガー イベントを明示しています。（例：Affero GPLのすべての版のソフトウェアを改変した場合）

source: Some licenses require that FOSS Notices be retained or reproduced for attribution purposes.
ja: FOSSの告知／通知／表示（Notice）を帰属表示の目的で、保持、再生成することを求めるライセンスもあります。

source: Some licenses require the distribution of derivative works (or software in the same file, same program or other boundary) under the same terms as the original work
ja: ライセンスの中には、二次的著作物（もしくは同じファイルや同じプログラムにある、その他の境界内にあるソフトウェア）の再頒布を要求するものがあります。

source: Sometimes a project has a disjunctive licensing situation, but only one license is included in your code – so perhaps the person you got the code from already made this choice.
ja: 時として、プロジェクトが離接的なライセンス下にあっても、自分のコードに組み入れられているのが一つのライセンスだけという場合、コード入手元がすでにこの選択をすでに実施したことなります。

source: Sometimes these are confused with FOSS but their requirements are actually different.
ja: これらは時としてFOSSと混同されることがありますが、その要求事項は実質的に異なります。

source: Source code availability.
ja: ソースコードの入手しやすさ

source: Source code delivery
ja: ソースコードでのデリバリ

source: Source code for the audit is identified
ja: 監査のためのソースコードが特定される

source: Source code has been audited
ja: ソースコードが監査されている

source: Source may be scanned by a software tool
ja: ソフトウェアツールによってソースがスキャンされる

source: Specialists
ja: 専門家

source: Specialists working with business interests, commercial licensing, export compliance, etc., who may be impacted by FOSS usage
ja: FOSSの使用によって影響を受ける可能性のある、事業収益、商用ライセンス、輸出コンプライアンスなどを取り扱う専門家

source: Static/Dynamic Linking
ja: 静的／動的リンク（Static/Dynamic Linking）

source: Steps:
ja: ステップ：

source: System call
ja: システム コール

source: Templates such as these may be created by engineering teams to help educate the FOSS review team about planned FOSS usage.
ja: このようなテンプレートは計画的なFOSSの使用に当たり、FOSSレビューチームへの教育支援のためにエンジニアリングチームによって作成されることもあります。

source: Termination clauses (if you breach, you lose license)
ja: 解除条項（違反すれば、ライセンスを失うこと）

source: The first pitfall described in this slide arises where copyleft-style licensed FOSS is inadvertently mixed with proprietary code.
ja: このスライドで挙げている最初の落とし穴として、コピーレフト型のライセンスのFOSSが気づかれずプロプライエタリのコードと混在してしまうことを説明しています。

source: The BSD license is an example of a permissive license that allows unlimited redistribution for any purpose as long as its copyright notices and the license's disclaimers of warranty are maintained
ja: BSDライセンスは、著作権表示やライセンスの保証に係る免責事項が維持される限り、いかなる目的においても無制限の再頒布を許容するパーミッシブなライセンスの一例。

source: The FOSS Review is a basic building block of a FOSS Compliance Program.
ja: FOS レビューはFOSSコンプライアンス プログラムの基本的構成要素です。

source: The FOSS Review process includes the following steps:
ja: FOSS レビューのプロセスには以下のステップがあります：

source: The FOSS Review process should be accessible to Program/Product Managers, Engineers and others who may be working with FOSS.
ja: FOSSレビューのプロセスは、FOSSを取り扱うプログラムマネージャ、プロダクトマネージャ（製品マネージャ）および技術者たちが利用できる必要があります。

source: The FOSS Review process should be flexible enough to allow the interested parties to collaborate. Sometimes a FOSS usage scenario may not be clear to the FOSS review team.
ja: FOSSレビューのプロセスは利害関係のある参加者が協力できるよう、柔軟なものになる必要があります。時としてFOSSの利用シナリオがFOSSレビューチームにとって明確でないこともあります。

source: The FOSS Review process should have oversight (for example, an Executive Review Committee in this diagram).
ja: FOSSレビュープロセスは監督機能を持つ必要があります。（例えば、この図ではレビュー実行委員会）

source: The FOSS Review process should have sufficient oversight in cases of disagreement between any of the parties involved, or when a decision is particularly important.
ja: FOSS レビューのプロセスにおいては、関係者間での意見の相違があったり、ある決定が特別に重要だったりする場合を想定し、十分な監督機能が必要となります。

source: The FOSS Review team may consist of an interdisciplinary team
ja: FOSS レビューチームは異なった分野にまたがって構成することができます。

source: The FOSS Review team should assess the information it has gathered before providing guidance, including for issues such as:
ja: FOSSレビューチームは助言を提供する前に、例えば以下のような論点に対し、収集した情報を査定する必要があります。

source: The FOSS Review team should have the expertise to properly assess the FOSS usage. This may require support from engineering teams to educate legal and business teams about the proposed FOSS usage.
ja: FOSSレビューチームは、FOSSの使用を適切に評価するための専門知識を有する必要があります。提案されたFOSSの使用についてリーガルやビジネスチームを教育するためにエンジニアリングチームから支援を求めることもできます。

source: The approval and its conditions should be registered in a tracking system
ja: 承認内容とその条件がトラッキングシステム（追跡システム）に登録される必要があります。

source: The approval should also include important details such as version numbers of FOSS components and the approved usage scenario.
ja: この承認では、FOSSコンポーネントの版数や承認される使用シナリオといった重要となる詳細情報を盛り込む必要があります。

source: The approval should specify versions of approved FOSS components, the approved usage model for the component, and any other applicable obligations under the FOSS license
ja: この承認では、承認対象のFOSSコンポーネントのバージョン、使用モデル、およびその他FOSSライセンス下での適切な義務などを明確にする必要があります。

source: The company also verifies that notices are properly produced and included in distribution packages as needed.
ja: また企業は告知／通知／表示（notice）が適切に生成され、頒布パッケージに盛り込まれていることを必要に応じて確認します。

source: The company may also scan the source code to verify the origin and composition of the code.
ja: また企業はソースコードの起源や構成を検証するためにスキャンも実施します。

source: The copyright notices, attribution and source code normally helps to identify who is licensing the FOSS software.
ja: 通常、著作権表示、帰属表示およびソースコードが誰がそのFOSSソフトウェアをラインセンスしているかを特定する助けとなります。

source: The copyright owner only has control over the work that he or she created, not someone else’s independent creation
ja: その作品の著作権保有者だけが、他の誰かが独立して創造したものではない、自らが創造した作品のコントロールができる。

source: The definition of "derivative work" is subject to different views in the FOSS community.
ja: 「二次的著作物」の定義はFOSSコミュニティでもその見解がさまざまになりがちです。

source: The development team requests the review of a FOSS component or an outgoing release
ja: 開発チームがFOSSコンポーネントのレビューや外部向けのリリースを要望する

source: The distribution package contains only software that has been reviewed and approved
ja: 頒布パッケージがレビューされ承認されたソフトウェアだけを含んでいる

source: The engineering team will need the ability to provide further input.
ja: エンジニアリングチームはより深くインプットを提供するための技量が必要となるでしょう。

source: The first is to know your obligations and have a process to support this knowledge.
ja: 一つは、自身の義務（FOSSを発見し、追跡する）を知り、この知見を支えるプロセスをもつことです。

source: The first step in our example process is to identify FOSS usage.
ja: ここでの例における最初のステップは、FOSSの使用方法を確認することです。

source: The first step is to identify the proper parties to initiate a FOSS Review
ja: 最初のステップはFOSSレビュー開始するために適切な参加者を特定ことです。

source: The goal of shareware is to give potential buyers the opportunity to use the program and judge its usefulness before purchasing a license for the full version of the software
ja: シェアウェアの目的は、将来の購買者がその有用性を評価できるよう、そのソフトウェアの完全版ライセンスを購入する前にプログラムを使用する機会を提供することです。

source: The legal team may be supported by others, including:
ja: リーガルチームは他の人たちからサポートされる場合もあります。次のような人たちがいます：

source: The legal team, which may include in-house or outside attorneys, reviews and evaluates the FOSS usage for license obligations
ja: リーガルチームは、社内もしくは外部の弁護士を含めることができ、ライセンスの義務に応じたFOSS使用をレビューし評価します。

source: The license can be limited to:
ja: ライセンスは以下に対し制限されうる：

source: The license can have conditions on the grants, meaning you only get the license if you comply with certain obligations
ja: ライセンスはその供与に条件を持たせることができる。すなわち何らかの義務を満たした場合にのみ、そのライセンスを得るということ。

source: The license contains a clause restricting use of the names of contributors for endorsement of a derived work without specific permission
ja: このライセンス（三条項BSDライセンス）は二次的著作物の宣伝に対し、許可のないコントリビュータ名の使用を制限する条項を含んでいる。

source: The method for initiating this process may vary by company, but should be open to those who are involved in using FOSS in development.
ja: このプロセスを開始する手法は企業によって異なりますが、開発におけるFOSSの使用に関わる人たちにはオープンにするべきです。

source: The most basic requirement is to include a copyright notice.
ja: もっとも基本的な要求は 著作表示を含めることです。

source: The next few slides explain these concepts in more detail.
ja: 次の数枚のスライドでこれらのコンセプトを詳細に説明します。

source: The next step is auditing source code identified in the previous step.
ja: 次のステップは前のステップで確認されたソースコードの監査です。

source: The oversight committee may make important policy decisions or resolve disagreements between parties in the review process.
ja: 監督委員会は、重要な方針決定や、レビュープロセスでの関係者の意見の不一致の解決などを行います。

source: The package name, version, download URL, license, description and intended use in your product is a good starting point.
ja: 第一歩としては、パッケージ名、版数（バージョン）、ダウンロード元URL、ライセンス、説明、製品内で意図される使用法などがよいでしょう。

source: The patent owner has the right to stop anybody from exercising that functionality, regardless of independent creation
ja: 特許保有者は、独立創作（Independent creation）に関わらず、あらゆる人に対しその機能の使用を停止することができる

source: The precisely level of detail you will need depends on your organization and intended use case.
ja: 組織や意図しユースケースに依存して明確なレベルの詳細情報が必要となるでしょう。

source: The process may begin with one of these events:
ja: このプロセスは以下のイベントのうちのひとつで開始されます：

source: The process should be flexible enough so that FOSS users in your organization have access to guidance.
ja: 組織におけるFOSSの使用者が助言（ガイダンス）を利用できるよう、そのプロセスは柔軟であるべきです。

source: The public domain declaration is not the same as a FOSS license
ja: このパブリック ドメイン宣言はFOSSライセンスと同じものではありません。

source: The result of compliance due diligence is an identification of all FOSS used in the Supplied Software.
ja: コンプライアンスの適正努力の結果、供給ソフトウェアで使用されている全てのFOSSを特定します。

source: The review team may then produce an audit report with its conclusions regarding the origin and licensing of the source code.
ja: レビューチームはこのときソースコードの起源とライセンスに関して結論づけた監査レポートを生成します。

source: The review team should provide appropriate feedback to the engineering team to resolve the issues.
ja: レビューチームはこの問題を解決するためにエンジアリングチームに適切なフィードバックを提供する必要があります。

source: The right to distribute
ja: 頒布する権利

source: The right to reproduce the software – making copies
ja: ソフトウェアを 複製する 権利 – コピーを作成する

source: The right to create "derivative works" – making modifications
ja: "二次的著作物" を作る権利– 修正を加える

source: The second is to satisfy the obligations.
ja: もう一つは、ライセンスの義務を果たすことです。

source: The source code may or may not be available, and creation of derivative works is usually restricted
ja: そのソースコードは取得できる場合もそうでない場合もあります。二次的創作物は一般的に制限されます。

source: The source code should be of the same version and content that corresponds to the binary version you distribute.
ja: ソースコードは同じ版数のものでなくてはならず、内容は頒布するバイナリ版に対応していなくてはいけません。

source: The step may also begin if the review team discovers or is notified that FOSS is being used in a software release or in third party software used by the company, and that a proper review needs to take place.
ja: またこのステップはレビューチームがソフトウェア リリースやその企業が使用するサード パーティのソフトウェアFOSSが使用されていることや適正なレビューの実施が必要であることを発見したり、知らされたりした場合に開始することもできます。

source: The teams may also organize and track information gathered regarding FOSS usage to assist with later compliance processes.
ja: また本チームは、後続するコンプライアンスプロセスを支援するべく、FOSSの使用について収集した情報を整理し、追跡することも実施します。

source: The term derivative work refers to a new work based upon an original work to which enough original creative work has been added so that the new work represents an original work of authorship rather than a copy (note that this is a term of art under US law)
ja: 二次的著作物という用語はその新しい著作物が著作権者の原作に基づいて表現できるように、原作に対し十分に独創的で創造的な作業が加えらた、原作に基づく新しい作品のことを言います。（なおこの用語は米国法令に基づいているのでご留意ください。

source: The term public domain refers to intellectual property not protected by law and therefore usable by the public without requiring a license
ja: パブリック ドメインという用語は法令で保護されない知的財産のことを言います。このため公衆は（パブリックドメインのものを）ライセンスを求めることなく使用することができます。

source: The tracking system should make it clear that a new approval is needed for a new version of a FOSS component or if a new usage model is proposed
ja: トラッキングシステムは新しい版数のFOSSコンポーネントや新しい使用モデルが提案された場合に対しては新たな承認が必要となることを明確にする必要があります。

source: The two main goals of a FOSS compliance program are know your obligations and to satisfy your obligations.The important business practices of a FOSS compliance program include:
ja: FOSSコンプライアンスプログラムの二つの主要なゴールとは 自身の義務を知ること と義務を果たすことです。FOSSコンプライアンス プログラムでの重要な業務としては以下が含まれます：

source: The work crosses disciplines, including engineering, business and legal teams, and may require in follow-up discussion so that all parties understand the underlying issues.
ja: この作業はエンジニアリング、ビジネス、リーガルチームなど分野をまたいだものとなります。また全ての参加者が潜在的な問題を理解できるようにフォローアップの議論が必要となる場合もあります。

source: There are a couple additional issues in the case of external vendors.
ja: 外部ベンダーの場合には、いくつか付加的な論点があります。

source: There are other types of license used.
ja: その他のタイプのライセンスも使われます。

source: These can be used as the basis for in-house tests for FOSS compliance.
ja: これらの質問や答えはFOSSコンプライアンスの組織内テストの素材として使うことができます。

source: These licenses often have very different requirements and rules compared to FOSS licenses.
ja: これらのライセンスをFOSSライセンスと比較すると多くの場合、要求事項、やールがとても違っています。

source: These obligations may trigger upon key events, such as:
ja: 以下のような主要なイベントでこれらの義務が発動する場合があります：

source: These slides can be used to help train internal teams about FOSS compliance issues and to conform with the OpenChain Specification.
ja: 本スライドは、組織内チームに向けたFOSSコンプライアンスに係る重要事項についてトレーニングを実施する際のヘルプやOpenChainの仕様との照らし合わせに用いることができます。

source: These slides follow US law.
ja: 本スライドは米国法令に準じています。

source: These teams may provide support using code scanning or forensics tools to identify FOSS components in a codebase.
ja: このチームはコードベース（ソースコードの集積場所）にあるFOSSコンポーネントを特定するためのコードスキャンツールやフォレンジクス（法的確証収集）ツールを使った支援などを行います。

source: They require distribution of the original work and derivative works under the same terms as the original work.
ja: これらは原著作物と二次的著作物を、原著作物と同じ条件の下で頒布することを要求します。

source: This chapter contains an example of a detailed end to end compliance management process.
ja: 本章は、エンド ツー エンド（端から端まで）のコンプライアンス マネジメント プロセスの詳細例について記載しています。

source: This chapter describes a “FOSS Review” process in which FOSS usage is analyzed and the relevant obligations are determined
ja: 本章では「FOSSレビュー」について述べます。FOSSの使用方法が分析され、関連する義務が決定されます。ermined

source: This chapter describes some common pitfalls in FOSS compliance processes, and discusses approaches to avoiding these pitfalls
ja: 本章では、FOSSコンプライアンス プロセスで共通的な落とし穴について説明します。併せてそいった落とし穴を回避するアプローチについて考察します。

source: This chapter describes some fundamental concepts in understanding FOSS usage
ja: 本章ではFOSSの使用を理解する際の根本的な概念のいくつかについて述べます。

source: This chapter is focused on the “big picture” of Intellectual Property.
ja: 本章は知的財産の"全体像"に焦点を当てます。

source: This chapter is probably most useful for managers or developers who might not understand clearly the fundamentals of copyright, patent and trademark law.
ja: おそらく本章は著作権法、特許法、商標法の基礎について明確に理解していない可能性のある管理者や開発者にとって、最も有用なものとなります。

source: This chapter is useful for lawyers, managers or developers who may not be familiar with FOSS licenses.
ja: 本章は法律家や管理職、もしくはFOSSライセンスに馴染みが薄い開発者の方がにとって有用です。

source: This chapter provides an example of an enterprise process.
ja: 本章では大規模企業（エンタープライズ）のプロセス例を提供します。

source: This chapter will describe some potential pitfalls to avoid in the compliance process:
ja: 本章は、コンプライアンス プロセスで回避したい、潜在的な落とし穴について説明していきます。

source: This chapter will focus on copyright and patents, the areas most relevant to FOSS compliance
ja: 本章ではFOSSコンプライアンスに最も関係する、著作権と特許権に焦点を当てます。

source: This chapter covers the big picture of FOSS compliance.
ja: 本章では FOSSコンプライアンスについての全体増を取り扱います。

source: This is an important consideration when choosing code and choosing licenses.
ja: コードやライセンスを選択する際にこれは重要な検討事項となります。

source: This is difficult if the copyrighted work is popular such that it'd be reasonable to assume that you had access. If your software reads on a patent, then you will need a patent license regardless of whether you've independently developed the software.
ja: その著作権をもつ作品が有名でアクセスできると考えることが合理的だとすると、これを示すことは困難となります。ソフトウェアについてある特許の文言に読み取れる場合には、そのソフトウェアが独立開発かどうかには関係なく特許ライセンスが必要となるでしょう。

source: This is referred to as a ”Copyleft", "reciprocal", or "hereditary" effect
ja: これは、「コピーレフト」もしくは「互恵的」/「遺伝的」効果と言及されます。

source: This is the situation where more than set of license terms can apply to a piece of software.Conjunctive = Multiple licenses apply
ja: これは、1セットより多くのライセンス条項がソフトウェアに適用される状況です。結合的（Conjunctive） ＝ 複数のライセンスを適用します。

source: This may be discovered through auditing source code for license notices or using code scanning tools.
ja: この状況はソースコードのライセンスの告知／通知／表示（notice）に対し監査や、コードスキャンツールの使用を通じて発見されることがあります。

source: This may include:
ja: 以下のようなものがあります：

source: This may mean providing the source code along with the software distribution, making it available through a written offer, or posting a source code archive on a website.
ja: このことは、ソースコードをソフトウェア頒布にともに提供し、それを書面による申し出（written offer）を通じ入手可能とすること、もしくはWebサイトでソースコードのアーカイブを公開することを意味します。

source: This overview is not intended to cover all aspects of Intellectual Property. It is intended to provide context for the “big picture” and to establish that today we are only discussing copyright and patents, the areas most relevant to FOSS compliance.
ja: ここにある概説で知的財産のすべての側面を網羅することは意図していません。 ここで意図しているのは、"全体像"となる背景を提供し、当日議論するのがFOSSコンプライアンスにもっとも関係する著作権と特許権のみだということを確認してもらうことです。

source: This process may be assisted by support teams, including teams that run code scanning tools to scan for undisclosed FOSS usage.
ja: このプロセスは支援チームの助けを借りることができます。公開されていないFOSS使用に対しコードスキャンツールにって精査することができます。

source: This should be taken into account when using these slides as part of a compliance training program.
ja: コンプライアンス トレーニング プログラムの一部で本スライドを使う際にはこの点を考慮する必要があります。

source: This slide clarifies the most important parts of copyright law to software.
ja: このスライドでは、ソフトウェアに対する著作権法の最重要部分を明確にしています。

source: This slide contains a template that may be used to illustrate FOSS usage and its relationship with company software.
ja: このスライドは、FOSSの使用と企業のソフトウェアとの関係を説明するために使うテンプレートを掲載しています。

source: This slide describes some of the benefits that compliance brings to an organization beyond the fact of fulfilling the legal obligations of the license.
ja: このスライドではコンプライアンス がライセンスの法的義務の履行という事実ベースの域を越え、組織にもたらすメリットについて述べています。

source: This slide describes the definition of compliance management and its end goals.
ja: このスライドは、コンプライアンスマネジメントと最終目標について述べています。

source: This slide explains how FOSS compliance programs work in “broad stokes” (a basic overview).
ja: このスライドでは、コンプライアンス プログラムがどのように機能するかについて大まかに（基本的概要として）説明しています。

source: This slide explains license compatibility, the way of understanding what licenses can be used together.
ja: このスライドではライセンスの両立性について説明しています。両立性は、どのライセンスが一緒に使用できるかを理解する上での考え方です。

source: This slide explains more about how FOSS compliance practices can work in an organization.
ja: このスライドでは FOSSコンプライアンス実務が組織内でどのように機能するかについてさらに説明しています。
